# Importing requried libraries

In [1]:
import pandas as pd
import numpy as np

# Createt dataframe

In [2]:
df = pd.DataFrame(
                    {
                    'name':['alok','rahul','rohit','ashish','avinash','nehaN','nehaR','aarul'],
                    'marks':[33,44,55,66,77,88,96,99],
                    'salary':[3,4,5,6,7,8,9,10]
                    }
                )
df

      name  marks  salary
0     alok     33       3
1    rahul     44       4
2    rohit     55       5
3   ashish     66       6
4  avinash     77       7
5    nehaN     88       8
6    nehaR     96       9
7    aarul     99      10

# Creating beans to convert `numerical` data into `strings`

In [3]:
bins = (2,50,99)
group_names = ['low_score','high_score']
df['marks'] = pd.cut(df['marks'],bins=bins,labels=group_names)
df['marks'].unique()

['low_score', 'high_score']
Categories (2, object): ['low_score' < 'high_score']

In [4]:
df

      name       marks  salary
0     alok   low_score       3
1    rahul   low_score       4
2    rohit  high_score       5
3   ashish  high_score       6
4  avinash  high_score       7
5    nehaN  high_score       8
6    nehaR  high_score       9
7    aarul  high_score      10